{
  "name": "Aztec Soup (Sopa de Tortilla)",
  "source": "https://www.souschef.co.uk/blogs/the-bureau-of-taste/huevos-rancheros-recipe-by-adriana-cavita",
  "author": "Adriana Cavita",
  "image": "/recipe-images/aztec-soup-sopa-de-tortilla-.webp",
  "ingredients": "**For the soup:\n- 1 dried guajillo and 1 dried pasilla chilli, veins and seeds removed (or use 11⁄2 tablespoons chipotle chillies in adobo paste from a jar or can)\n- 150 ml olive oil\n- 2 garlic cloves, chopped\n- ½ white onion, chopped\n- 1.5 kg tomatoes, chopped\n- 2 x 15-cm/6-in. tortillas, deep-fried and cut into strips\n- 1 litre chicken or vegetable stock\n- 2 fresh epazote sprigs or 1 teaspoon hoja santa powder\n- 1½ tablespoons sea salt\n\n**To serve:\n- Sour cream\n- 200 g fresh cheese (such as feta or Polish twarog)\n- 1 avocado, stoned, peeled and cut into cubes\n- 8 tortillas, cut into thin strips and deep-fried until crisp\n- 1 pasilla chilli, cut into thin strips and lightly toasted in a pan with 2 tablespoons oil",
  "instructions": "- Soak the dried chillies in a bowl of warm water for about 1 hour. Drain the chillies, reserving their soaking water if you want to use it to add more heat to the dish.\n- Heat the oil in a saucepan over a medium-high heat. Add the garlic and onion and cook for about 3 minutes. Once they begin to colour, add the tomatoes and soaked chillies (or chipotle chillies) and cook for about 10 minutes. Add half the deep-fried tortillas and the stock and cook for a further 5 minutes.\n- Add the epazote or hoja santa, then use a handheld stick blender to blend the soup until smooth.\n- Strain through a fine-mesh sieve and return to the pan to heat through again. Taste and add more salt if needed. Add more stock if the soup is too thick.\n- Ladle the soup into bowls and swirl in some sour cream. Place a few cubes of cheese and avocado on top of the soup. Finish each bowl with a handful of the deep-fried tortilla strips and toasted chilli strips.",
  "cookingTime": "25 minutes",
  "prepTime": "1 hour",
  "country": "Mexico",
  "course": "soups",
  "servings": "8",
  "calories": 3357,
  "slug": "aztec-soup-sopa-de-tortilla-",
  "dateAdded": "2024-04-13"
}