{
  "name": "Bacon Wrapped Meatloaf with Fennel",
  "author": "Jamie Oliver",
  "source": "https://www.jamieoliver.com/recipes/beef-recipes/meatloaf/",
  "course": "mains",
  "prepTime": "15 minutes",
  "cookingTime": "2 hours",
  "calories": "5376",
  "servings": "12",
  "slug": "bacon-wrapped-meatloaf-with-fennel",
  "dateAdded": "2024-02-16",
  "image": "/recipe-images/bacon-wrapped-meatloaf-with-fennel.webp",
  "ingredients": [
    "4 medium bulbs of fennel",
    "olive oil",
    "2 onions",
    "2 carrots",
    "15g fresh sage",
    "15g fresh rosemary",
    "125g mozzarella cheese",
    "200g sourdough breadcrumbs",
    "1 kg minced pork",
    "1 kg minced beef",
    "2 tsp wholegrain mustard",
    "2 large free-range eggs",
    "12 rashers smoked streaky bacon",
    "500ml chicken stock",
    "2 tbsp blackcurrant jam",
    "1 tbsp sun-dried tomato purée"
  ],
  "instructions": [
    "Preheat the oven to 180ºC/350ºF/gas 4.",
    "Trim each fennel bulb and chop into eight wedges, then place in a large roasting tray, drizzle with oil, season with sea salt and black pepper and roast for 30 minutes.",
    "",
    "Meanwhile, peel and dice the onions and carrots, place in a large pan with 1 tablespoon of oil on a medium-low heat and cook for 20 minutes, stirring occasionally.",
    "Pick the herb leaves, finely chop half of them and add to the veg pan, saving the rest for later.",
    "",
    "Leave the veg to cool completely, then tear in the mozzarella and add the breadcrumbs, minced meat, mustard, eggs, and a good pinch of sea salt and black pepper. Scrunch and mix well, then shape into a loaf.",
    "",
    "Make a space in the middle of the fennel tray and sit the meatloaf in the centre. Criss-cross the smoky bacon over the meatloaf, drizzle with a little oil, then cover the tray with tin foil.",
    "Roast for 30 minutes, then remove from the oven and discard the foil.",
    "",
    "Mix the chicken stock, jam and tomato purée together in a jug until smooth, then pour into the tray. Toss the reserved herbs with a little oil and scatter into the tray, then return to the oven for a final 45 minutes, or until cooked through.",
    "If the juices need thickening at this stage, simply put the tray on the hob to reduce for a few minutes, until they’re the consistency of your liking, skimming away any fat from the surface, if needed.",
    "Serve the meatloaf, sweet fennel and juices with mash and seasonal greens."
  ]
}