{
  "image": "/recipe-images/beef-ragu-fettuccine.webp",
  "name": "Beef Ragu Fettuccine",
  "author": "Pinch of Nom",
  "source": "Pinch of Nom Cookbook, pg.152",
  "course": "mains",
  "country": "Italy",
  "calories": 1780,
  "servings": "4",
  "ingredients": "- 200 g dried fettuccine\n- 300 g stewing beef all visible fat removed\n- 500 g tomato passata\n- 2 cloves garlic crushed\n- 2 beef stock cubes made up with 300ml boiling water\n- 2 tsp dried oregano\n- 2 tsp dried basil\n- 50 g pearl barley\n- 1 onion finely diced\n- 1 carrot finely diced\n- 1 courgette finely diced\n- 150 g mushrooms thinly sliced\n- 1 tsp Worcester sauce\n- 2 tbsp tomato puree\n- oil",
  "instructions": "**Pressure Cooker:\n- Place a large pan of water onto the hob to boil for the pasta\n- Spray the Instant Pot with a little low calorie cooking spray, then add the beef, press the Sauté button and brown the meat - this will take a few minutes. Once browned, add the veg and sauté for a further 2 minutes\n- Press the Off button and add the remaining ingredients into the Instant Pot. Click the Manual button and adjust the time to 30 minutes, ensuring the venting valve is closed\n- Cook the pasta according to the instructions on the packet. When the Instant Pot has finished cooking, use the Quick Pressure Release method, drain the pasta (when cooked) and stir into the ragu\n- Serve immediately with a sprinkle of parmesan (remember to add extra calories or points it if using it!)\n\n**Slow Cooker:\n- Spray a frying pan with a little low calorie cooking spray, then sauté the meat until browned - this will take a few minutes. Once browned, add the veg and saute for a further 2 minutes\n- Tip the contents of the pan into the slow cooker then add all the remaining ingredients (apart from the pasta)\n- Set to medium-high and allow to cook for 5 to 6 hours or until the meat starts to break up\n- Place a large pan of water onto the hob to boil for the pasta\n- Cook the pasta according to the instructions on the packet, then drain the pasta (when cooked) and stir into the ragu",
  "cookingTime": "35 minutes",
  "prepTime": "10 minutes",
  "slug": "beef-ragu-fettuccine",
  "dateAdded": "2024-04-18"
}