{
  "name": "Brioche Burger Buns",
  "author": "The Pink Whisk",
  "source": "https://www.thepinkwhisk.co.uk/2013/07/brioche-burger-buns.html",
  "course": "baking",
  "cookingTime": "22 minutes",
  "servings": "8",
  "prepTime": "6 hours",
  "slug": "brioche-burger-buns",
  "dateAdded": "2024-02-16",
  "image": "/recipe-images/brioche-burger-buns.webp",
  "ingredients": "<ul><li><p>500g strong white flour</p></li><li><p>50g caster sugar</p></li><li><p>4 large eggs</p></li><li><p>4 tsp water</p></li><li><p>1 tsp salt</p></li><li><p>3 tsp fast action yeast</p></li><li><p>250g softened butter</p></li><li><p>1 egg beaten for egg wash</p></li></ul>",
  "instructions": "<p>Place all the ingredients into a bowl.</p><p>Fit the beater blade to the stand mixer.</p><p>Turn on the mixer and get it beating the dough together – let it mix for 5 minutes.</p><p>After 5 minutes beating the dough will be starting to look much more like a dough.</p><p>Scrape the dough down into a rough ball at the bottom of the bowl and change the beater for the dough hook.</p><p>Now let the machine knead the dough (on a low setting 2-3) for 10 minutes.</p><p>So now the dough should be lovely and smooth.</p><p>Transfer it to a large bowl, cover and allow to stand at room temp for 1 hour.</p><p>After 1 hour, place the bowl into the fridge to chill for a further 2 hours. This bit is important – it chills the dough to a cold clay like texture so that you can shape it easily.</p><p>So nicely chilled and firm, time to split the dough into 8 equal portions – approx 128g each.</p><p>Flatten each portion of dough out, gather the edges into the middle and then flip the ball over. Using a caged hand over the top of the ball with your fingers touching the worksurface move your hand in a clockwise circle to neaten the ball shape.</p><p>Set them all onto a lined or well greased baking tray</p><p>Cover them loosely with a sheet of clingfilm and let them rise until nearly doubled in size.</p><p>This does take a while 2-3 hours at normal room temp, longer if its cold. The dough is cold from the fridge and needs to come up to room temp before it will start rising. Be patient and if your dough won’t get going move it to a warmer spot, a sunny window ledge should do the trick.</p><p>Now preheat the oven to 160c (fan)/180c/Gas Mark 4.</p><p>When the buns are ready for the oven double brush them with egg wash for a lovely golden finish.</p><p>Bake in the oven for 22 minutes.</p><p>Remove and allow to cool on a wire rack.</p>"
}
