{
  "ingredients": "- 1 quantity of <a href=\"/recipe/savoury-pastry\">savoury pastry</a>\n- a little plain flour for rolling\n- 500g peeled potatoes, cut into 2cm cubes\n- 2 medium onions, chopped\n- 600g chedar cheese, coarsely grated\n- 3 medium eggs, beaten\n- 1 medium egg yolk, beaten",
  "instructions": "To make this you need a flan tin with a removable base, 25cm in diameter and around 5-7cm deep.\n\n- Lightly flour your work surface. Take around 2/3 of the pastry (wrap the rest int clingfilm and chill in the fridge), and roll out into a circle ~3mm thick and 5cm wider than the tin. Wrap the pastry carefully around your rolling pin to lift it, and drop it gently into the flan tin. Press the pastry into the base and sides of the tin, leaving a little excess overhanging the edge.\n- Put the tin on a baking tray and chill in the fridge while you prepare the filling.\n- Half fill a medium pan with lightly salted water and bring to the boil. Cook for 5 minutes, or until cooked but still slightly firm. Add the onions and return to the boil, then drain immediately in a colander. Tip into a large bowl and leave to cool.\n- When the vegetables are cold, stir in the cheese and beaten whole eggs until thouroughly combined.\n\n- Take the pastry case from the fridge and fill with the potato and cheese mixture.\n- Lightly flour your work surface again and roll out the remaining pastry to make a lid for the pie. Drape it over the top, press to seal the edges, and trim off the excess.\n- Make a large hole in the center of the pie and brush over the lid with the remaining egg yolk. Put the pie back into the fridge to chill and set for an hour.\n- Preheat the oven to 180C. To decorate the top, score in a pattern with a sharp knife.\n- Bake on a baking tray for 45-60 minutes, until the pastry is nicely browned and the filling is hot throughout.",
  "name": "Cheddar, Potato and Onion Pie",
  "author": "Daylesford",
  "source": "A Love For Food, pg.184",
  "vegetarian": true,
  "course": "mains",
  "country": "United Kingdom",
  "image": "/recipe-images/cheddar-potato-and-onion-pie.webp",
  "servings": "8",
  "slug": "cheddar-potato-and-onion-pie",
  "dateAdded": "2024-03-15"
}
