{
  "author": "Anna Jones",
  "source": "Easy Wins, pg.90",
  "image": "/recipe-images/cheese-and-pickle-roast-potatoes-with-chilli-dressed-leaves.webp",
  "name": "Cheese and Pickle Roast Potatoes with Chilli-dressed Leaves",
  "vegetarian": true,
  "course": "mains",
  "ingredients": "- 1kg new potatoes, scrubbed clean\n- 10 cornichons (35g), roughly chopped, plus 100ml of the brine from the jar\n- 100ml extra virgin olive oil\n- 3 fresh red chillies\n- juice of 1 unwaxed lemon\n- 100g Comté cheese or vegan mature Cheddar-style cheese, grated\n- 1 head of radicchio or other bitter lettuce\n- salt",
  "calories": 2083,
  "servings": "4",
  "instructions": "- Preheat the oven to 200c fan. Bring a large pan of salted water to the boil, add 1kg scrubbed new potatoes and cook for 10–20 minutes, depending on their size, until they are just cooked. Drain and leave the potatoes to steam dry in a colander.\n- Tip the potatoes into a roasting tin, toss them with 50ml cornichon brine, 2 tablespoons olive oil and salt and pepper, then roast for 15 minutes. Remove the tin from the oven and, using a potato masher, squish the potatoes until they crack and expose some of the soft, fluffy insides. Pour over another 2 tablespoons olive oil and return to the oven for another 30 – 40 minutes, turning the potatoes halfway, until golden and crispy.\n- Prick 3 fresh red chillies with the tip of a sharp knife – this stops them exploding when they are cooked. Using a pair of metal tongs, hold the chillies one at a time over a gas flame until they’re blackened and blistered all over. If you don’t have a gas hob you can do this in a dry frying pan.\n- Once they are all blistered, put them in a small bowl, cover and leave for 15 minutes. This way they will steam in their own heat and the skins will peel off easily. Once cool enough to handle, peel the chillies, open them up and scrape out all the seeds. Discard the seeds and finely chop the flesh.\n- Put in a mixing bowl with the remaining olive oil (70ml) and the juice of 1 unwaxed lemon and mix well. Season to taste with sea salt and black pepper.\n- Once the potatoes are golden and crisp, add 50ml of cornichon brine while the potatoes are still hot, then toss with 10 roughly chopped cornichons and a generous grating of Comté or vegan Cheddar. Tear 1 head of radicchio into bite-sized pieces, season with Pure Sea Salt and toss in the chilli dressing.",
  "cookingTime": "70 minutes",
  "prepTime": "20 minutes",
  "country": "United Kingdom",
  "slug": "cheese-and-pickle-roast-potatoes-with-chilli-dressed-leaves",
  "dateAdded": "2024-04-22"
}