{
  "author": "Tessa Kiros",
  "source": "Food From Many Greek Kitchens, pg.108",
  "image": "/recipe-images/galaktoboureko-custard-filo-pie-.webp",
  "name": "Galaktoboureko (Custard Filo Pie)",
  "course": "desserts",
  "country": "Greece",
  "vegetarian": true,
  "servings": "12",
  "ingredients": "- 120g unsalted butter, melted to golden\n- 12 sheets Filo pastry, at least 30x38cm in size\n\n** Syrup\n- 280g sugar\n- 1 long strip lemon peel\n\n** Filling\n- 225g sugar\n- 75g fine semolina\n- 20g cornflour\n- 4 egg yolks, plus 2 whole eggs\n- 1.5 ltr milk\n- 2 tsp vanilla extract\n- a nice grating of fresh nutmeg",
  "calories": 6088,
  "instructions": "**Syrup\n- Put the sugar and lemon peel in a small saucepan and add 185ml water. Put over a medium heat and stir until the sugar dissolves. Bring to the boil and simmer for about 5 minutes. Remove from the heat and cool.\n- Preheat the oven to 175C.\n\n**Filling\n- Put the sugar, semolina and cornflour in the bowl of an electric mixer. Add all the eggs and beat until thick and pale. Heat the milk, vanilla and nutmeg in a large saucepan to just below boiling.\n- Add a ladleful to the eggs and mix in.\n- Add another ladleful, mix, and continue until all the milk has been added.\n- Scrape back into the pot and return it to the heat on low for 5 or 10 minutes, whisking often until it is very thick and nothing sticks on the bottom.\n- When it is thickened, and just at the point before boiling, remove from the heat.\n\n**Assemble\n- Have the Filo sheets ready, covered by a tea towel to keep them moist. Brush the inside of a 22x30cm oven dish with butter.\n- Lay 1 sheet of filo on your work surface and brush with the butter. Cover it with another sheet, brush with butter and repeat until you have a stack of 6 sheets. Lift them up and fit into the oven dish, covering the base and the sides.\n- Press them gently into the corners of the dish to make a nest for the filling. Pour the filling on top and smooth the surface.\n- Make another stack of 6 buttered filo sheets and lift onto the pie, covering the filling. Press the two overhanging layers of pastry together, and trim the overhang to about an inch. Roll the edges over on themselves to make a seal.\n- Use a sharp knife to gently score the top pastry into 12 pieces, only cutting through a few sheets. Flick a little cold water here and there to prevent the filo curling.\n- Bake until crisp and golden, about 25 minutes. Remove from the oven and rest for a couple of minutes, then pour the syrup over the top, covering all the pie.\n- Now leave for at least 1 hour before serving to allow the syrup to settle as the pie cools.\n\nNote:\nThis will keep for a number of days, covered with a tea towel - not refrigerated.\nIf your filo sheets are smaller than your dish, use more sheets and cut to fit with a little overlap.",
  "cookingTime": "45 minutes",
  "prepTime": "20 minutes",
  "slug": "galaktoboureko-custard-filo-pie-",
  "dateAdded": "2024-04-23"
}