{
  "image": "/recipe-images/lemon-artichoke-and-butter-bean-paella.webp",
  "name": "Lemon, Artichoke and Butter bean Paella",
  "servings": "6",
  "ingredients": "- 1.5 litres vegetable stock\n- 2 onions, peeled and finely chopped (keep the trimmings)\n- 1 carrot, peeled and finely chopped (keep the trimmings)\n- good-quality extra virgin olive oil\n- 1 bulb fennel, finely chopped, any herby bits kept for later\n- 1 red pepper, deseeded and finely chopped\n- 2 ripe tomatoes, flesh finely chopped, seeds discarded\n- 4 cloves of garlic, peeled and finely chopped (keep the trimmings)\n- 1 heaped tsp sweet smoked paprika\n- 1 large pinch of saffron threads, soaked in - 50ml warm water\n- 100ml white wine\n- 100ml tomato passata\n- 300g short-grain paella rice (or risotto)\n- 700g jar butter beans, drained\n- 400g jar artichokes, chopped into bite-sized pieces\n- 1 unwaxed lemon, cut into 8 wedges to serve\n- a small bunch of parsley (30g), chopped",
  "calories": 2652,
  "instructions": "- Heat the stock. Put the stock in a pan and add all the trimmings to add some more depth to the stock. You can add a bit more veg here if you have some on hand.\n- Heat about 4 tablespoons of oil in your pan, add the onions, carrot and fennel and sauté for about 10 minutes until really soft and sweet and beginning to brown. Add the red pepper, tomatoes, garlic and paprika and cook for another few minutes. Add the saffron, wine and passata and cook for another few minutes.\n- Add the rice to the pan and stir it well to coat, adding more oil here if you think you need it. Strain the stock. Shuffle the rice into an even layer and add about 800ml of the stock. Simmer hard, no stirring, for 10 minutes, by which time a good amount of the liquid should have been absorbed but it should still feel like there is enough for it to cook for another 10 minutes. If not, add some of the remaining stock. Remember, no stirring.\n- Next, scatter over the butter beans and artichokes and cook, without stirring, for another 8-10 minutes. Again, if the rice looks too dry before it’s cooked (check by trying some – it should be just al dente but not too hard or chalky), add a little more stock, but do not stir it in.\n- The key to the crispy bottom (the socarrat) is to let it cook for a while after all the liquid has been absorbed. You should hear a sizzle or an almost rain/popcorn popping-like noise. Leave it for about 30 seconds then turn off the heat – you should begin to see the edges crisp. The thicker the base of the pan you have, the harder this is. If you serve and haven’t got a crispy bottom, drizzle a little oil around the edge of the pan and put it back on a high heat for another 5 minutes, or so. Take it off the heat and cover to allow it to rest for 10 minutes then top with lemon wedges, a small bunch of chopped parsley and any fennel fronds.",
  "cookingTime": "1 hour",
  "prepTime": "15 minutes",
  "country": "Spain",
  "course": "mains",
  "source": "Easy Wins, pg.182",
  "author": "Anna Jones",
  "slug": "lemon-artichoke-and-butter-bean-paella",
  "dateAdded": "2024-04-22"
}