{
  "slug": "nanaimo-bars",
  "name": "Nanaimo Bars",
  "author": "Rock Recipes",
  "source": "https://www.rockrecipes.com/nanaimo-bars/",
  "course": "dessert",
  "vegetarian": false,
  "prepTime": "25 minutes",
  "cookingTime": "5 minutes",
  "calories": 6732,
  "servings": 36,
  "ingredients": [
    " Bottom layer",
    "3/4 cup butter",
    "1/3  cup sugar",
    "8 tbsp cocoa",
    "2 eggs, beaten",
    "2 1/4 cups graham crumbs",
    "3/4 cup fine or medium unsweetened coconut",
    "1/2 cup chopped walnuts toasted",
    "",
    " Middle layer",
    "2 1/4 cups icing sugar",
    "1/2 cup custard powder",
    "2/3 cup butter, at room temperature",
    "1 tsp vanilla paste or extract",
    "2 tbsp whipping cream",
    "",
    " Top layer",
    "1 cup chocolate chips",
    "2 tbsp butter"
  ],
  "instructions": [
    " Base layer",
    "Melt together the butter, sugar and cocoa over low heat.",
    "Add the eggs continue to cook, stirring constantly to fully cook the egg to a soft scrambled texture.",
    "Add the graham crumbs, coconut and walnuts.",
    "Mix together until well combined then, press into the bottom of a parchment paper lined 9x9 inch baking pan.",
    "",
    " Filling",
    "With an electric mixer, beat together the butter, custard powder and icing sugar until it starts to come together.",
    "Add the vanilla paste and whipping cream and beat well until smooth.",
    "This frosting should be very stiff but spreadable. ( Much thicker than you would use to frost a cake for example) If you think it's too thick, you may add a few drops of whipping at a time to bring it to the right consistency.",
    "Spread evenly over the bottom layer. Chill in the fridge for a couple of hours before adding the chocolate topping.",
    "",
    " Chocolate Topping",
    "Melt together the chocolate chips and butter over low heat, just until the chocolate is melted, don't over heat it.",
    "Spread quickly over the chilled frosted layer. Return to the fridge until the chocolate sets.",
    "Cut into squares or bars. These freeze very well."
  ],
  "image": "/recipe-images/nanaimo-bars.webp"
}
