{
  "name": "Northern-Style Beef Stew Birria",
  "source": "https://www.souschef.co.uk/blogs/the-bureau-of-taste/tagged/cuisine-mexico",
  "author": "Adriana Cavita",
  "course": "mains",
  "country": "Mexico",
  "ingredients": "**For the birria\n- 2kg beef shin or lamb shoulder, cut into 10cm/4\" chunks with the bones left in\n- 1½ tbsp salt\n\n**For the sauce\n- 10 guajillo chillies, seeds and veins removed and lightly toasted\n- 4 cascabel or pasilla chillies, seeds and veins removed and lightly toasted\n- 4 anchos chillies, seeds and veins removed and lightly toasted\n- 7 garlic cloves\n- ½ white onion, cut into chunks\n- 1 tbsp cumin seeds\n- ½ tbsp black peppercorns\n- 4 cloves\n- 1 tbsp Mexican dried oregano\n- 2 tbsp white wine vinegar\n- 2kg tomatoes, asados, seeds and skins removed (optional)\n\n**To serve\n- Warm tortillas\n- Your favourite salsas and sauces",
  "image": "/recipe-images/northern-style-beef-stew-birria.webp",
  "calories": 3346,
  "instructions": "- First, prepare the sauce. Place all the ingredients for the sauce in a food processor or blender with 500 ml water and blend until smooth. Strain through a fine-mesh for an even smoother sauce. In Mexico, we add water to the pulp left in the sieve and then strain again to extract maximum flavour.\n- Preheat the oven to 200°C/180°C fan/400°/Gas 6.\n- Season the meat with salt and place in a deep roasting pan. Roast in the preheated oven for about 10 minutes or until the meat starts to take on some colour. Pour the sauce over the meat, making sure that everything is covered — if there is not enough sauce to cover the meat, add a bit more water. Lower the oven temperature to 180°C/160°C fan/350°F/Gas 4. Cover the roasting pan with kitchen foil and cook for 4–5 hours until the meat easily falls off the bone.\n- Serve the birria with tortillas and your favourite salsas and sauces.",
  "cookingTime": "5 hours",
  "prepTime": "20 minutes",
  "servings": "10",
  "slug": "northern-style-beef-stew-birria",
  "dateAdded": "2024-04-13"
}
