{
  "author": "Tessa Kiros",
  "source": "Food From Many Greek Kitchens, pg.254",
  "course": "mains",
  "country": "Greece",
  "name": "Pastitsio (Mince, Macaroni & Bechamel Layers)",
  "servings": "10",
  "ingredients": "- 400g long, thin macaroni (or buccatini)\n- 40g grated mizithra or salted ricotta\n\nMeat Sauce:\n- 5 tbsp olive oil\n- 2 large red onions, grated on the large holes of a grater\n- 800g beef mince\n- 200g pork mince\n- 2 garlic cloves, chopped\n- 3 whole cloves\n- 3 allspice berries\n- 250ml red wine\n- 400g tin chopped tomatoes\n- 1 tbsp tomato puree\n- 2 tbsp chopped flat-leaf parsley\n\nBechamel:\n- 2 ltr milk\n- 1/2 tsp ground cinnamon\n- 1/4 tsp ground cloves\n- 240g unsalted butter\n- 250g plain flour\n- 3 eggs\n- 80g coarsely grated mizithra or salted ricotta",
  "calories": 9320,
  "image": "/recipe-images/pastitsio-mince-macaroni-bechamel-layers-.webp",
  "instructions": "** Meat Sauce\n- Heat the oil in a large frying pan that has a lid. Add the onion and both minces and fry over a high heat until all the moisture goes.\n- Add the garlic, cloves and allspice and when that smells good, add the wine. Cook until most of it has evaporated then add the tomato, tomato paste and parsley, and season well with salt and pepper.\n- Stir in 500ml of hot water. Put the lid on, lower the heat and simmer for about 45 minutes. You want a compact, almost dry sauce so take the lid off for the last 10 minutes if you need to reduce it.\n- Taste for seasoning, put the lid back on and keep aside.\n\n** Pasta\n- Cook the macaroni in boiling salted water to just done. Drain very well and put into the bottom of a 26x34cm oven dish. Add the 40g grated cheese, mixing it through the pasta. Press the pasta down so it is compact for slicing later.\n- Preheat the oven to 180C.\n\n** Bechamel\n- Heat the milk, cinnamon and cloves in a large saucepan. Melt the butter in a large wide pot. Add the flour to the butter and stir  with a wooden spoon on low heat until smooth, then add the warm milk bit by bit, stirring all the time. Now whisk until you have a thick cream, and remove from the heat.\n- Break the eggs into a bowl and beat. Whisk a ladleful of bechamel into the eggs to acclimatise them, then whisk the whole lot back into the sauce. Add the 80g grated cheese and season to taste.\n\n**Bake\n- Scrape the meat sauce over the pasta in a good level layer and press it down. Pour the bechamel over the top. Bake for 30-40 minutes or until the bechamel is firm and golden brown on top.\n- Remove from the oven and allow to cool for 45 minutes before serving, so that the layers become firm enough to slice.",
  "cookingTime": "1.5 hours",
  "prepTime": "15 minutes",
  "slug": "pastitsio-mince-macaroni-bechamel-layers-",
  "dateAdded": "2024-04-23"
}