{
  "image": "/recipe-images/pon-samosas.webp",
  "prepTime": "20 minutes",
  "cookingTime": "25 minutes",
  "course": "sides",
  "country": "India",
  "author": "Pinch of Nom",
  "source": "Pinch of Nom Cookbook, pg.224",
  "name": "PoN Samosas",
  "servings": "6",
  "calories": 906,
  "ingredients": "- 2 medium potatoes\n- 75 g frozen peas\n- 2 20g sheets filo pastry\n- 1/2 onion diced\n- 1 clove garlic crushed\n- 1 tsp fresh ginger finely chopped\n- 1 good pinch chilli powder\n- 1/2 tsp ground coriander\n- 1/4 tsp ground cumin\n- 1/4 tsp ground turmeric\n- 1/4 tsp garam masala\n- low calorie cooking spray\n- sea salt to taste",
  "instructions": "- Cook the potatoes in the microwave until they are soft and cook the peas in some boiling salted water.\n- Peel the cooked potatoes and cut them into a rough dice.\n- Spray a frying pan with some low calorie cooking spray, then sauté the onions, garlic, ginger and all of the spices until the onion is cooked.\n- Stir in the potato and drained peas and cook for a minute or two, then mash roughly with a spoon.\n- If the mix looks very dry, add a little of the water that you cooked the peas in. Taste and season if necessary.\n- Remove from the heat and allow to cool.\n- Line an oven tray with baking parchment and preheat the oven to 180°C.\n- Take each sheet of filo and cut it in half length ways.\n- Spray the filo with some butter low calorie cooking spray, making sure you get the edges.\n- Place a spoonful of the potato mix at the bottom of the length of filo. Fold the filo diagonally to enclose the filling. Press down on the edge of the filo and fold diagonally again.\n- Repeat until you reach the end of the filo. You should have a triangular parcel.\n- Place the parcel seam side down on the baking parchment. Then make up the remaining 3 samosas.\n- Spray each samosa with low calorie cooking spray and cook for 20 minutes or until they are golden brown. Turn halfway through cooking so they crisp up evenly.Alternatively you could place them on a wire rack so they cook evenly.",
  "slug": "pon-samosas",
  "dateAdded": "2024-04-18"
}