{
  "author": "Meera Sodha",
  "source": "https://www.theguardian.com/food/2024/feb/03/vegan-roast-cauliflower-kimchi-couscous-salad-recipe-meera-sodha",
  "name": "Roast Cauliflower and Kimchi Couscous Salad",
  "vegetarian": true,
  "prepTime": "15 minutes",
  "cookingTime": "40 minutes",
  "course": "salads",
  "servings": "4",
  "ingredients": "**For the salad**\n- 1 large cauliflower (or 2 small ones), trimmed and cut into florets (750g net)\n- Rapeseed oil\n- Salt\n- 2 sweet potatoes (400g), washed and cut into 2cm cubes\n- 250g giant couscous\n- 100g baby-leaf spinach, roughly chopped\n- 20g parsley\n- 100g kimchi, sliced\n- 200g hummus\n- 2 tbsp pumpkin seeds\n\n**For the dressing**\n- 2cm piece fresh ginger, peeled and finely grated\n- 1 lemon, zest finely grated, then juiced, to get 2.5 tbsp\n- 1 tbsp light agave syrup\n- 90ml rapeseed oil\n- 1 tsp salt",
  "instructions": "- Heat the oven to 220C (200C fan)/425F/gas 7, and line two large baking trays with greaseproof paper.\n- Cut out the base from the cauliflower and remove and discard the outer larger leaves; keep the inner tender ones. Break the cauliflower into 4cm florets, cut the inner leaves into 3cm strips and cut the stalk into ½cm pieces. Put all the cauliflower in a bowl with three tablespoons of rapeseed oil and a half-teaspoon of salt, then mix really well. Tip on to one of the lined trays and spread out evenly.\n- Put the cubed sweet potato in the same bowl, add a tablespoon of oil and a quarter-teaspoon of salt, toss to coat, then tip on to the second tray. Roast the cauliflower for 20-25 minutes, until golden brown, and the sweet potato for 30 minutes.\n- Meanwhile, make the dressing. In the same bowl, mix the grated ginger, lemon zest and juice, agave syrup, oil and salt, and whisk to combine.\n- Cook the couscous in plenty of boiling water, according to the packet instructions, then drain really well. Transfer to the bowl of dressing, add the cooked cauliflower and sweet potato, stir in the spinach and parsley, toss and taste for seasoning.\n- Divide the salad between four large bowls, top each portion with two tablespoons of hummus, a tablespoon of kimchi and a sprinkling of pumpkin seeds, then serve.",
  "slug": "roast-cauliflower-and-kimchi-couscous-salad",
  "dateAdded": "2024-03-04",
  "image": "/recipe-images/roast-cauliflower-and-kimchi-couscous-salad.webp"
}