{
  "name": "Salmon Curry with Yoghurt & Spiced Cauliflower Rice",
  "ingredients": "- 1 tsp cumin seeds\n- 1 tsp coriander seeds\n- 1 tbsp coconut oil\n- 1 tbsp garam masala\n- 2cm piece of turmeric, peeled and finely grated\n- 3 shallots, finely chopped\n- 2 garlic cloves, finely chopped\n- 2cm piece of ginger, peeled and finely chopped\n- 1/2 red chilli, finely chopped\n- 200ml natural yoghurt\n- 10g coriander, finely chopped lime juice, to taste\n- 1 tbsp sesame oil\n- 2 organic salmon fillets, with skin\n- handful of greens (spinach, roughly chopped chard, cavolo nero or kale)\n- handful of cashew nuts, toasted\n- sprinkling of coconut chips, toasted\n- salt and black pepper\n\nFor the spiced cauliflower rice:\n- 1 tbsp cumin seeds\n- 1 tsp coconut oil\n- 1/2 red onion, finely chopped\n- 1 garlic clove, finely chopped\n- 1/2 red chilli, finely chopped (optional)\n- 1/2 cauliflower (roughly 300g)\n- 15g coriander, roughly chopped\n- juice of 1/4 lime",
  "servings": "2",
  "course": "mains",
  "source": "https://www.daylesford.com/shop/grocery/recipes/main-dishes/salmon-curry-with-yoghurt-and-spiced-cauliflower-rice",
  "author": "Daylesford",
  "image": "/recipe-images/salmon-curry-with-yoghurt-spiced-cauliflower-rice.webp",
  "instructions": "- For the curry, put the cumin and coriander seeds into a pan over a low heat and leave for 2–3 minutes or until the the aromas are released.\n- Transfer to a pestle and mortar and grind coarsely. Return to the pan with the coconut oil, garam masala, turmeric, shallot, garlic, ginger and chilli and sauté until the shallots have softened.\n- Stir in the yoghurt, add the coriander, then season with salt, pepper and lime juice to taste. Set aside.\n\nFor the cauliflower rice:\n- Toast the cumin seeds in a small pan, as above. When fragrant, add the oil, onion, garlic and chilli, if using, and sauté for 2–3 minutes or until the onion is soft.\n- Meanwhile, break the cauliflower into smaller florets and put into a food processor. Pulse gently until the cauliflower resembles uncooked rice. Stir it into the pan of spices before placing over a medium heat and adding 3 tablespoons of water. Cook gently for 4 or 5 minutes, until the cauliflower is just beginning to soften. Add a little more water if the pan is looks dry. Remove from the heat, stir through the coriander and lime and transfer to a bowl.\n- Rinse your pan and return it to the heat with the sesame oil. When nice and hot, season the salmon and place it in the pan, skin side down. Fry for 3 to 4 minutes, until the skin is crispy, before turning over and cooking for 1 to 2 minutes on the other side, or until done to your liking.\n- Put the greens into a colander and pour over a kettle of boiling water, leave to strain.\n- Gently re-heat the curry sauce, divide the cauliflower between two bowls and top with the curry then the greens. Place the salmon fillets on top, scatter over the cashews and coconut chips and serve with an extra drizzle of lime if you wish.",
  "prepTime": "10 minutes",
  "cookingTime": "20 minutes",
  "slug": "salmon-curry-with-yoghurt-spiced-cauliflower-rice",
  "dateAdded": "2024-03-15"
}
