{
  "servings": "4",
  "image": "/recipe-images/slow-cooked-lamb-shoulder-with-white-beans-and-salsa-verde-mayonnaise.webp",
  "name": "Slow Cooked Lamb Shoulder with White Beans and Salsa Verde Mayonnaise",
  "author": "Daylesford",
  "source": "A Love For Food, pg.232",
  "course": "mains",
  "prepTime": "Overnight + 30 minutes",
  "cookingTime": "4 hours",
  "ingredients": "- 4 tbsp olive oil\n- 6 cloves garlic, chopped\n- 1 tsp fresh thyme leaves\n- salt and pepper\n- 1.5kg shoulder of lamb, boned and rolled\n- 2 carrots, roughly chopped\n- 1 large onion, chopped\n- 1 leek, chopped\n- 1 heaped tbsp tomato puree\n- 125ml red wine\n- 1 ltr chicken stock\n- <a href=\"/recipe/salsa-verde-mayonnaise\">salsa verde mayonnaise</a>, to serve\n\nFor the beans:\n- 150g dried white beans\n- 25g butter\n- 1 small onion, finely chopped\n- 1 clove garlic, crushed\n- 1 carrot, finely chopped\n- 2 tbsp chopped fresh parsley\n- 1 tbsp chopped fresh tarragon\n- 1 tbsp chopped fresh mint\n- 150g baby spinach leaves, roughly shredded\n- salt and pepper",
  "instructions": "- Mix 2 tbsp of the oil with the garlic, thyme, salt and pepper and then rub all over the lamb. Leave to marinate overnight in the fridge.\n- Soak the beans in cold water overnight too, then drain.\n\n- The next day, preheat the oven to 160C.\n- Heat the remaining 2 tbsp oil in a casserole dish that has a lid, put in the lamb and brown on all sides, then lift out and keep to one side.\n- Add the carrots, onion and leek and cook over a low heat for 5 minutes, until the vegetables have softened but are not coloured.\n- Add the tomato puree and the red wine, and bubble up to reduce the liquid by half. Return the lamb to the casserole, add the stock, and pour in enough water to cover the meat. Bring to a simmer, cover and put into the preheated oven for about 3 hours, until the lamb is very tender.\n- Lift out the lamb from the casserole and keep to one side.\n\n- To cook the beans, heat the butter in a large heavy-based saucepan. When it's foaming, add the onion and garlic and cook gently for 5 minutes, or until the onion is translucent. Add the carrot and the drained white beans and strain in the reserved cooking liquid from the lamb.\n- Bring to the boil, then turn down to a simmer for 30-40 minutes, stirring occasionally, until the beans are tender (you may need to top up with a little water).\n- Remove from the heat and stir in the herbs and spinach. Taste and season as necessary.\n- Return the cooked lamb to the pan over a low heat until heated through.\n\n- To serve, lift out the lamb and slice into 4. Spoon the beans and sauce onto a warmed dish. Arrange the lamb on top and drizzle with a little olive oil. Serve with a bowl of the salsa verde mayonnaise.",
  "slug": "slow-cooked-lamb-shoulder-with-white-beans-and-salsa-verde-mayonnaise",
  "dateAdded": "2024-03-15"
}
