{
  "source": "Basque: Spanish Recipes From San Sebastián & Beyond, pg.150",
  "author": "José Pizarro",
  "name": "Spinach and Goat's Cheese Croquetas",
  "image": "/recipe-images/spinach-and-goats-cheese-croquetas.webp",
  "ingredients": "- 500g baby leaf spinach\n- 400ml full-fat milk\n- 100ml strong vegetable stock\n- 80g butter\n- 125g plain flour\n- 80g goats cheese, crumbled\n- salt & black pepper\n- freshly ground nutmeg\n- 2 large eggs, beaten\n- 125g dry breadcrumbs\n- olive oil for deep frying",
  "servings": "32",
  "calories": 2483,
  "country": "Spain",
  "course": "snacks",
  "instructions": "- Heat a large frying pan over a medium-high heat and add the spinach with a tiny splash of water. Cook for 3-4 minutes or until completely wilted, then run under cold water. Once cold, squeeze out all of the water, finly chop and set aside.\n- In a saucepan, heat the milk and stock together. In another saucepan, melt the butter over a medium heat, add the flour and cook for 2-3 minutes. When the mixture starts to turn brown, begin by adding the milk and stock very slowly until you get a really silky-smooth mix. This will take approximately 10 minutes.\n- Add the cheese to the mixture slowly, then add the spinach and stir constantly until it is well combined. Season with salt & pepper and a grating of nutmeg.\n- Spread the mixture onto a shallow tray and press a sheet of clingfilm over the top. Cool down in the fridge for a minimum of 2 hours.\n\n- Put some oil in the palm of your hand and roll the mixture into 30g balls. If they are a little soft, pop them onto a tray in the freeer to firm up for 30 minutes.\n- Place the beaten egg and beadcrumbs into two separate bowls. Dip the croquetas first into the beaten egg and then into the breadcrumbs.\n- Heat the oil to 180C and fry the croquetas for around 2 minutes or until golden. Drain on paper towels, then eat straight away.\n\nNote:\nThese can be frozen ahead of time, and then defrosted before frying.",
  "prepTime": "2.5 hours",
  "cookingTime": "5 minutes",
  "slug": "spinach-and-goats-cheese-croquetas",
  "dateAdded": "2024-04-22"
}
