{
  "source": "Far Eastern Odyssey, pg.223",
  "author": "Rick Stein",
  "name": "Sri Lankan chicken curry",
  "course": "mains",
  "country": "Sri Lanka",
  "prepTime": "10 minutes",
  "cookingTime": "50 minutes",
  "ingredients": "- 2 tbsp coconut or vegetable oil\n- 1.5 kg chicken, jointed into 8 pieces\n- Freshly ground black pepper\n- 15cm cinnamon stick, broken into pieces\n- 10 green cardamom pods, bruised\n- 10 cloves\n- 350g onions or shalllots, halved and thinly sliced\n- 40g garlic, crushed\n- 25g peeled ginger, finely grated\n- 1 tsp roasted <a href=\"/recipe/sri-lankan-curry-powder\">Sri Lankan curry powder</a>\n- 1/2 tsp chilli powder\n- 1/2 tsp turmeric\n- 1 medium tomato (approx. 100g), chopped\n- 10 fresh curry leaves\n- 1 green chilli\n- 225ml coconut milk\n- juice of 1/4 large lime",
  "image": "/recipe-images/sri-lankan-chicken-curry.webp",
  "calories": 4220,
  "servings": "4",
  "instructions": "- Heat the oil in a large, heavy bottomed cooking pot or casserole dish with a heavy fitting lid over a medium high heat. Season the chicken thighs really well with salt, and brown on both sides until golden, working in batches if necessary. Set aside.\n- Add the cinnamon stick, cloves and cardamom pods – crushed with the side of your knife to reveal their seeds – to the remaining fat in the pan and cook until sizzling.\n- Lower the heat to medium and add the onions and the 1/2 tsp of salt, cooking for about 10 minutes until the onions are starting to soften and brown. \n- Stir in the garlic and ginger, and cook for another couple of minutes until aromatic.\n- Stir in the roasted curry powder, chilli powder and turmeric, cooking for another few minutes until the new layer of flavours are once again aromatic.\n- Stir in the tomato, curry leaves and the green chilli, split in half then nestle the chicken thighs amongst the mixture. Put on the lid and lower the heat for medium low, allowing the curry to simmer for 25 minutes, stirring halfway to scrape up all the flavours from the bottom of the pot, until the chicken has cooked through and the mixture is saucy.\n- Stir in the coconut milk and allow to simmer, uncovered, for a further 5 minutes.\n- Stir in the lime juice, to taste, and serve with rice.",
  "slug": "sri-lankan-chicken-curry",
  "dateAdded": "2024-05-13"
}
