{
  "ingredients": "** For the omelette\n- 40g of butter or ghee\n- 3 spring onions, thinly sliced\n- 1 medium-hot green chilli, finley chopped\n- 250g fresh white crab meat\n- 1 1/2 tsp lime or lemon juice\n- Freshly ground black pepper\n- 4 large eggs\n- Small handful of coriander leaves, chopped\n\n** For the gravy\n- 3 tbsp vegetable oil\n- 100g onions, finely chopped\n- 15g garlic, crushed\n- 30g peeled ginger, grated\n- 10-12 curry leaves\n- 1 lemongrass stalk\n- 10cm cinnamon stick, broken\n- 6x2.5cm pandan leaf\n- 12/2 tsp kashmiri chilli powder\n- 400ml coconut milk\n- 1 tsp roasted <a href=\"/recipe/sri-lankan-curry-powder\">Sri Lankan curry powder</a>",
  "source": "Far Eastern Odyssey, pg.246",
  "author": "Rick Stein",
  "name": "Sri Lankan Crab Omelette with Curried Coconut Gravy",
  "servings": "4",
  "calories": 2123,
  "prepTime": "10 minutes",
  "cookingTime": "20 minutes",
  "instructions": "- For the gravy, heat the oil in a medium pan over a medium heat. Add the onion, garlic, ginger and curry leaves and fry gently for 5-6 minutes until the onion is very soft. Halve and bruise the lemongrass stalk, and break the cinnamon into smaller pieces. Add the lemongrass, cinnamon and pandan leaf to the pan and fry for 1 minute.\n- Add the chilli powder, turmeric and curry powder and fry for 1 minute more. Add the coconut milk and leave to simmer for 5-10 minutes until thickened. Remove the lemongrass and season to taste with salt. Set aside and keep warm.\n\n- For the omelette, heat 15g of the butter in a small frying pan, add the spring onions and chilli and fry for 1 minute until softened. Add the crab meat and toss over a low heat for 1-2 minutes until heated through. Sprinkle over the lime or lemon juice and season to taste with salt and pepper. Set aside and keep hot.\n\n- Break the eggs into a bowl, season with 1/2 tsp salt and some black pepper and whisk well. Heat a 25cm frying pan over a high heat, add the remaining 25g butter and, as soon as it is foaming, swirl it to coat the pan and pour in the eggs. Cook, pulling the egg into the center as it sets, until lightly golden underneath but still moist on top.\n- Stir the coriander into the crab meat and spoon it down the center of the omelette. Fold the sides over the filling and roll the omelette onto a serving plate. Slice across into 4 pieces, spoon over some of the gravy and serve.",
  "image": "/recipe-images/sri-lankan-crab-omelette-with-curried-coconut-gravy.webp",
  "course": "mains",
  "country": "Sri Lanka",
  "slug": "sri-lankan-crab-omelette-with-curried-coconut-gravy",
  "dateAdded": "2024-05-13"
}
