{
  "source": "https://www.islandsmile.org/srilankan-chicken-potato-curry/",
  "author": "Island Smile",
  "name": "Sri Lankan Chicken And Potato Curry",
  "prepTime": "20",
  "cookingTime": "40",
  "servings": "5",
  "calories": "3000",
  "slug": "sri-lankan-chicken-and-potato-curry",
  "course": "mains",
  "dateAdded": "2024-02-15",
  "image": "/recipe-images/sri-lankan-chicken-and-potato-curry.webp",
  "ingredients": [
    "500g of potatoes",
    "700g of chicken, chopped",
    "0.5 tsp of turmeric powder",
    "",
    " Tempering ingredients",
    "3 tbsp of oil",
    "2 medium-sized onions, chopped fine",
    "2 tbsp of ginger-garlic paste",
    "2 green chillies, split in the middle",
    "2 inch cinnamon",
    "3 cardamom pods",
    "2 bay leaves",
    "1 star anise",
    "",
    " Ingredients to cook the chicken potato curry",
    "0.5 tsp turmeric powder",
    "1 tsp red chilli powder",
    "1 tbsp of curry powder ",
    "2 tsp fresh black pepper",
    "Salt to season",
    "250ml of water",
    "125ml coconut milk"
  ],
  "instructions": [
    "Clean and cut the chicken to the required size.",
    "Make sure you cut the chicken parts slightly larger than the potatoes.",
    "Once they are cut, season with salt and a pinch of turmeric.",
    "Set aside till it’s time to add them to the cooking spice mix.",
    "",
    "Scrub, wash and place the potatoes in a pot, add water until the potatoes are completely submerged.",
    "Bring them to a boil, then reduce to medium heat and continue to simmer the potatoes.",
    "Once par-boiled, let them cool or peel them under running water and set them aside.",
    "Cut each potato into four large chunks and make sure all the potatoes are cut the same size.",
    "",
    "Place a large pan over medium heat and pour in the oil.",
    "Add the sliced onions, ginger-garlic paste, cinnamon, cardamom, green chilli, and sauté the ingredients for 3 minutes.",
    "Add the star anise, bay leaves to the pan and continue to sauté until the onions turn soft and translucent.",
    "",
    "Reduce heat to low and add turmeric, chilli powder, curry powder, black pepper.",
    "Combine all ingredients with the cooked spices.",
    "",
    "Add the chicken parts into the cooking spices, combine and then spread the chicken parts evenly in the pan.",
    "Make sure you let each side of the chicken slightly brown before turning them over.",
    "Continue cooking and browning the chicken over reduced heat so as not to burn the spices, 15-20 minutes.",
    "",
    "While the chicken semi-fries over a reduced heat, add the potatoes into the pan, combine and cook with the chicken for 10 minutes over a low-medium fire.",
    "Season with salt.",
    "Pour in the water and cook until water is reduced.",
    "Pour the coconut milk, add extra pepper if you need it and continue to cook until you have a thick gravy."
  ]
}
