{
  "source": "https://www.daylesford.com/shop/grocery/recipes/main-dishes/sticky-beef-brisket",
  "author": "Daylesford",
  "name": "Sticky Beef Brisket with Celeriac Remoulade",
  "cookingTime": "3 hours",
  "course": "mains",
  "servings": "6",
  "calories": "8516",
  "ingredients": "- 1.6kg beef brisket, boned and rolled\n- olive oil\n- 3 garlic cloves, sliced\n- 1 celery stick, diced\n- 2 shallots, diced\n- 1 litre chicken stock\n- ½ tsp chilli flakes\n- 4 tsp clear honey\n- 180ml red wine\n- 1½ tbsp tamari\n- 2.5cm piece of fresh ginger, grated\n- 20g smoked paprika\n\nFor the remoulade:\n- 1 large celeriac (about 650g), peeled and cut into thin matchsticks\n- juice of 1½ lemons\n- 360g mayonnaise          \n- 2 tsp wholegrain mustard             \n- 1 tsp chopped parsley    \n- drizzle of truffle oil (optional)\n- sea salt and black pepper",
  "instructions": "- Untie the beef brisket and cut in half widthways. If using the oven to cook the brisket, preheat it to 140ºC/120ºC fan. Heat a little olive oil in a large frying pan, untie the brisket and fry the beef on one side for 2–3 minutes until golden-brown. Use tongs to turn it over and repeat on the other side.\n- Remove the beef from the heat and place it in a deep casserole or your slow cooker.\n- Return the frying pan to the heat and add the garlic, celery, shallots and a little extra oil if needed. Cook for a few minutes, until softened, then add the chicken stock, chilli flakes and half the honey. Pour this mixture over the beef.\n- Meanwhile, put the red wine, tamari, grated ginger and smoked paprika into a blender and blitz until smooth. Pour this over the beef too, then pour in enough water to cover the meat by about 2.5cm.\n- Cover the meat with a sheet of silicone or baking paper, put the lid on top of your dish and place it in the preheated oven. If using a slow cooker, set it to high.\n- After 2.5 hours, remove the dish from the oven. Lift the paper, turn the brisket over and baste with the juices.\n- Return the paper and lid, then put the dish back into the oven for another 2 hours. If using a slow cooker, turn it down to medium.\n- While the beef is cooking, prepare the remoulade. Place the celeriac in a large bowl with the lemon juice and a pinch of salt and stir to combine. Cover and leave in the fridge while the beef finishes cooking.\n- After the cooking time, the beef should be tender and almost falling apart. Remove the dish from the oven and allow the meat to rest for 20 minutes. Turn the oven up to 190ºC/170ºC fan.\n- Once rested, gently remove the beef from the cooking juices using a large slotted spoon and place it on a large roasting tray. Try to keep the beef as two whole pieces. Pour the cooking juices into a heavy-bottomed pan with the remaining honey, bring to the boil and reduce over a high heat until it becomes thick and syrupy.\n- Use a pastry brush to cover the brisket generously with the sticky sauce, then roast in the oven for 10 minutes, until the beef has caramelised slightly.\n- Meanwhile, finish preparing the remoulade. Remove the bowl from the fridge and place the celeriac in a sieve to drain off any excess liquid. Return the celeriac to the bowl, and fold through the mayonnaise and mustard. Stir in the chopped parsley, a drizzle of truffle oil, if using, and season to taste with salt and pepper.\n- Once removed from the oven, brush the brisket generously with a little more sauce. When ready to serve pull the meat apart and serve with the celeriac remoulade.\n- Prepare ahead option – after slow-cooking, chill the beef and glaze the refrigerate or freeze until needed. Once ready to serve, warm through in the oven either in a deep dish or wrapped in silicone paper and then foil. Once nice and hot, repeat glazing as above.",
  "slug": "sticky-beef-brisket-with-celeriac-remoulade",
  "dateAdded": "2024-03-15",
  "image": "/recipe-images/sticky-beef-brisket-with-celeriac-remoulade.webp"
}