{
  "name": "Sweet Potato Shakshuka with Sriracha Butter",
  "author": "Ottolenghi",
  "source": "https://thehappyfoodie.co.uk/recipes/ottolenghi-sweet-potato-shakshuka/",
  "course": "mains",
  "country": "Tunisia",
  "vegetarian": true,
  "prepTime": "20 minutes",
  "cookingTime": "1 hour 20 minutes",
  "image": "/recipe-images/sweet-potato-shakshuka-with-sriracha-butter.webp",
  "ingredients": "- 1kg sweet potatoes, skin on and scrubbed clean\n- 1 small (100g) red onion, thinly sliced into rounds\n- 2 tbsp lemon juice\n- 3 tbsp olive oil\n- 150g mature cheddar, roughly grated\n- 3 garlic cloves, crushed\n- 1 tsp cumin seeds, roughly crushed with a pestle and mortar\n- 8 medium eggs\n- 25g unsalted butter\n- ¾ tbsp sriracha\n- 2 tbsp picked fresh coriander leaves, with some stem attached\n- salt and black pepper",
  "servings": "4",
  "calories": 2598,
  "instructions": "- Preheat the oven to 200°C fan. Poke the sweet potatoes all over with a fork (about 8–10 times) and place them on a medium, parchment-lined baking tray. Bake for 45–50 minutes, or until cooked through and softened. Set aside to cool and turn the oven temperature down to 180°C fan.\n- Meanwhile, in a small bowl mix together the onion, 1 tablespoon of lemon juice and a pinch of salt and set aside to pickle.\n- Remove the cooked potato skins and tear them into roughly 4cm pieces. Transfer the potato flesh to a large bowl and set aside. Place the skins back on the baking tray and toss with 1 tablespoon of oil, ¼ teaspoon of salt and a good grind of pepper. Bake for 8 minutes, or until nicely coloured and starting to crisp up. Set aside to cool and crisp up further.\n- Use a fork to mash the potato flesh until smooth, then add the cheddar, garlic, cumin, another tablespoon of oil, the remaining tablespoon of lemon juice, 1 teaspoon of salt and a generous grind of pepper, and mix to combine.\n- Put the remaining tablespoon of oil into a large frying pan, for which you have a lid, and swirl around to coat the bottom. Spoon the mashed potato mixture into the pan, using your spoon to distribute it evenly. Place on a medium-high heat and leave to cook for about 7 minutes, for the bottom to start to colour. Turn the heat down to medium and use a spoon to make eight wells in the potato mixture, breaking an egg into each. Sprinkle lightly with salt and pepper, cover with the lid and cook for 4–5 minutes, rotating the pan, or until the whites are set and the yolks are still runny.\n- While the eggs are cooking, put the butter and sriracha into a small saucepan on a medium heat and cook until the butter has melted, whisking constantly to emulsify. Remove the mixture from the heat before it starts to bubble – you don’t want it to split.\n- When ready, spoon the sriracha butter all over the eggs, then top with a good handful of the crispy potato skins, half the pickled onion and all the picked coriander leaves. Serve right away, with the rest of the potato skins and pickled onion to eat alongside.",
  "slug": "sweet-potato-shakshuka-with-sriracha-butter",
  "dateAdded": "2024-03-24"
}